new Vue({
    el: '#container',
    data: {
        buyin: [],
        sellout: [],
        accumulatedIncome: [],
        plus: [],
        minus: []
    },
    computed: {
        traders: function() {
            var tmp = [];

            return tmp;
        }
    },
    created: function() {
        // var self = this;
        // if(!self.token) {
        //     window.location.href = "./login.html" //取不到token跳转登录页
        // }
    },
    mounted: function() {
        var self = this;
        self.getBuyinSum();
    },
    methods: {

        getMinusSum: function() {
            var self = this;
            $.ajax({
                method: "POST",
                url: "http://127.0.0.1:8099/myfunds/public/index.php/index/index/minusSum",
                data: {

                }
            }).always(function(res) {
                //假数据START
                //假数据END
                console.log(res)
                // self.minus = res.result;
                self.minus = {
                    "积木盒子余额": 2,
                    "现金": 11285.359993339,
                    "历史持有项目": 3.8200000524521,
                    "工行9120": 11354.5800993,
                    "交通卡": 5182.5000004768,
                    "微信零钱": 20,
                    "招行信用卡": 30989.940071344,
                    "余额宝（1h:2小时）": 2172.5200169086,
                    "农银医疗保健股票000913": 261.60000300407,
                    "（京）富国医疗": 905.36999511719,
                    "京东白条": 4645.4600296021,
                    "食堂饭卡": 45.5,
                    "好\/富国医疗保健行业混合000220": 200.14000365138,
                    "好\/宝盈科技30混合000698": 286.26000022888,
                    "华宝兴业新兴产业混合240017": 29.199999809265,
                    "景顺长城内需增长混合260104": 17.920000076294,
                    "（微）工银沪深300指数": 18.030000209808,
                    "积存贵金属": 7.9700000286102,
                    "医院自助卡": 2096.8200073242,
                    "蚂蚁花呗": 3225.6099996567,
                    "南京药业": 635.05999660492,
                    "江苏银行": 3432.6099777222,
                    "微信零钱（？：？）": 2872.300003171,
                    "外汇-英镑": 37.050000429153,
                    "富国沪深300": 32.409999608994,
                    "大成标普500": 33.419999361038,
                    "佣金宝兴全300": 31.5,
                    "［自营］易方达沪深300量化增强110030": 25.819999814034,
                    "兴全": 16.5,
                    "（微）南方中正500ETF联接": 56.090000152588,
                    "飞牛网购物卡": 320.80000352859,
                    "其他应收款": 1458.7199981213,
                    "京东金条": 0.44999998807907,
                    "医院押金": 707.40002441406,
                    "张江高科": 307.54000091553,
                    "仁和药业": 555.29000091553,
                    "有利网余额": 1,
                    "京东小金库（即时：2小时）": 187.64999961853,
                    "［自营］南方中证500": 17.450000450015,
                    "南方上证380": 2.9199999570847,
                    "存金宝": 11.099999964237,
                    "京\/富国中证500指数增强": 29.050000190735,
                    "国泰估值优势混合LOF": 30.699999928474,
                    "招商安本增利债券217008": 13.390000361949,
                    "工行8212": 10.000000149012,
                    "美年健康": 446.5,
                    "优加宝贝154904": 1101.6000137329,
                    "富国医疗保健行业混合": 23.060000568628,
                    "金鹰稳健成长混合": 26.480000510812,
                    "易方达上证50指数": 16.759999811649,
                    "ofo预充值": 2,
                    "长信量化先锋混合": 36.97000002861,
                    "光大量化混合": 12.990000367165,
                    "最福利积分": 413.90000152588,
                    "储值账户": 365,
                    "纯爱气血循环": 2150,
                    "深圳机场": 135.95000004768,
                    "富国中证红利指数增强": 67.169997990131,
                    "携程饭卡": 815.5,
                    "摩拜预存": 9.5,
                    "MBK": 1200,
                    "宝钢股份": 77.51000213623,
                    "嘉实300": 42.199999451637,
                    "富国沪深300指数增强": 5.3099999427795,
                    "易方达消费行业股票": 2.8499999120831,
                    "博时沪深300": 5.3500001430511,
                    "易方达上证50": 3.2000000476837,
                    "建行": 34.989999771118,
                    "申万菱信沪深300增强": 9.3200000524521,
                    "易方达安心回报债券B": 3.5300000160933,
                    "富国低碳环保": 15.749999660999,
                    "景顺长城环保优势股票": 5.5699999332428,
                    "富国中证500增强": 14.350000441074,
                    "建信中证500": 6.3499999046326,
                    "好\/财通可持续混合000017": 92.770000338554,
                    "好\/中海蓝筹混合398031": 500.90999901295,
                    "南方小康ETF": 2.0299999564886,
                    "国泰互联网股票": 0.43999999761581,
                    "中石油加油卡": 1960.9799804688,
                    "东亚信用卡": 6581.1499705315,
                    "招商中证白酒": 2.7799999713898,
                    "迟到罚款": 20,
                    "停车场预付": 793.5,
                    "中航高科": 519.54999542236,
                    "宝宝体检现金": 415,
                    "交银施罗德消费新驱动": 2.1299999505281,
                    "（京东）南方中证500": 48.700000286102,
                    "国泰金龙行业混合": 14.740000486374,
                    "国投瑞银新兴产业混合": 15.320000000298,
                    "❤️财通可持续组合": 18.44000005722,
                    "广发核心精选混合": 18.219999551773,
                    "账户1": 0
                }
                // self.minus = {
                //     '（京东）南方中证500': 48.7,
                //     '（微）工银沪深300指数': 18.03,
                //     '（微）南方中正500ETF联接': 56.09,
                //     '［自营］南方中证500': 17.45,
                //     '［自营］易方达沪深300量化增强110030': 25.82,
                //     '宝钢股份': 77.51,
                //     '博时沪深300': 3.91,
                //     '存金宝': 7.25,
                //     '大成标普500': 16.56,
                //     '富国低碳环保': 15.75,
                //     '富国沪深300': 32.41,
                //     '富国沪深300指数增强': 3.86,
                //     '富国中证500增强': 13.55,
                //     '富国中证红利指数增强': 66.85,
                //     '国泰估值优势混合LOF': 30.7,
                //     '国泰金龙行业混合': 14.74,
                //     '国投瑞银新兴产业混合': 15.32,
                //     '好/财通可持续混合000017': 92.77,
                //     '好/中海蓝筹混合398031': -500.91,
                //     '华宝兴业新兴产业混合240017': 29.2,
                //     '积存贵金属': 7.97,
                //     '嘉实300': 42.2,
                //     '建信中证500': 6.35,
                //     '交银施罗德消费新驱动': -2.13,
                //     '京/富国中证500指数增强': 29.05,
                //     '景顺长城环保优势股票': 4.56,
                //     '景顺长城内需增长混合260104': 17.92,
                //     '美年健康': 446.5,
                //     '南方上证380': 2.92,
                //     '申万菱信沪深300增强': 7,
                //     '深圳机场': 135.95,
                //     '兴全': 16.5,
                //     '易方达安心回报债券B': 0.11,
                //     '易方达上证50': 1.86,
                //     '易方达上证50指数': 16.76,
                //     '易方达消费行业股票': 0.26,
                //     '佣金宝兴全300': 31.5,
                //     '招商安本增利债券217008': 13.39,
                //     '中航高科': 519.55
                // };
                self.getPlusSum();
            });
        },
        getPlusSum: function() {
            var self = this;
            $.ajax({
                method: "POST",
                url: "http://127.0.0.1:8099/myfunds/public/index.php/index/index/plusSum",
                data: {

                }
            }).always(function(res) {
                //假数据START
                //假数据END
                console.log(res)
                self.plus = res.result;
                console.log('===')
                console.log(self.minus)
                // self.minus = {
                //     '（京东）南方中证500': 48.7,
                //     '（微）工银沪深300指数': 18.03,
                //     '（微）南方中正500ETF联接': 56.09,
                //     '［自营］南方中证500': 17.45,
                //     '［自营］易方达沪深300量化增强110030': 25.82,
                //     '宝钢股份': 77.51,
                //     '博时沪深300': 3.91,
                //     '存金宝': 7.25,
                //     '大成标普500': 16.56,
                //     '富国低碳环保': 15.75,
                //     '富国沪深300': 32.41,
                //     '富国沪深300指数增强': 3.86,
                //     '富国中证500增强': 13.55,
                //     '富国中证红利指数增强': 66.85,
                //     '国泰估值优势混合LOF': 30.7,
                //     '国泰金龙行业混合': 14.74,
                //     '国投瑞银新兴产业混合': 15.32,
                //     '好/财通可持续混合000017': 92.77,
                //     '好/中海蓝筹混合398031': 500.91,
                //     '华宝兴业新兴产业混合240017': 29.2,
                //     '积存贵金属': 7.97,
                //     '嘉实300': 42.2,
                //     '建信中证500': 6.35,
                //     '交银施罗德消费新驱动': 2.13,
                //     '京/富国中证500指数增强': 29.05,
                //     '景顺长城环保优势股票': 4.56,
                //     '景顺长城内需增长混合260104': 17.92,
                //     '美年健康': 446.5,
                //     '南方上证380': 2.92,
                //     '申万菱信沪深300增强': 7,
                //     '深圳机场': 135.95,
                //     '兴全': 16.5,
                //     '易方达安心回报债券B': 0.11,
                //     '易方达上证50': 1.86,
                //     '易方达上证50指数': 16.76,
                //     '易方达消费行业股票': 0.26,
                //     '佣金宝兴全300': 31.5,
                //     '招商安本增利债券217008': 13.39,
                //     '中航高科': 519.55
                // };
                // self.plus = {
                //     '（京东）南方中证500': 62.28,
                //     '（微）工银沪深300指数': 63.44,
                //     '（微）南方中正500ETF联接': 110.77,
                //     '［自营］南方中证500': 26.26,
                //     '［自营］易方达沪深300量化增强110030': 88.32,
                //     '宝钢股份': 284.29,
                //     '博时沪深300': 28.11,
                //     '存金宝': 25.2,
                //     '大成标普500': 70,
                //     '富国低碳环保': 53.45,
                //     '富国沪深300': 160.67,
                //     '富国沪深300指数增强': 37.15,
                //     '富国中证500增强': 31.98,
                //     '富国中证红利指数增强': 107.08,
                //     '国泰估值优势混合LOF': 150.25,
                //     '国泰金龙行业混合': 58.44,
                //     '国投瑞银新兴产业混合': 51.78,
                //     '好/财通可持续混合000017': 279.83,
                //     '好/中海蓝筹混合398031': 728.86,
                //     '华宝兴业新兴产业混合240017': 236.68,
                //     '积存贵金属': 2.9,
                //     '嘉实300': 51.6,
                //     '建信中证500': 33.99,
                //     '交银施罗德消费新驱动': 72.62,
                //     '京/富国中证500指数增强': 54.26,
                //     '景顺长城环保优势股票': 31.99,
                //     '景顺长城内需增长混合260104': 111.56,
                //     '美年健康': 846.36,
                //     '南方上证380': 15.8,
                //     '仁和药业': 17.79,
                //     '申万菱信沪深300增强': 35.86,
                //     '深圳机场': 180,
                //     '兴全': 21.23,
                //     '易方达安心回报债券B': 22.56,
                //     '易方达上证50': 33.61,

                //     '易方达上证50指数': 25.31,
                //     '易方达消费行业股票': 11.1,
                //     '佣金宝可用资金': 2.5,
                //     '佣金宝兴全300': 148.49,
                //     '招商安本增利债券217008': 116.31,
                //     '中航高科': 565.91
                // };

                var fundarry = [
                    '国泰估值优势混合LOF',
                    '国投瑞银新兴产业混合',
                    '交银施罗德消费新驱动',
                    '易方达消费行业股票',
                    '富国低碳环保',
                    '易方达安心回报债券B',
                    '博时沪深300',
                    '申万菱信沪深300增强',
                    '南方小康ETF',
                    '国泰金龙行业混合',
                    '富国中证红利指数增强',
                    '❤️财通可持续组合',
                    '招商中证白酒',
                    '景顺长城环保优势股票',
                    '广发核心精选混合',
                    '易方达上证50',
                    '光大量化混合',
                    '长信量化先锋混合',
                    '金鹰稳健成长混合',
                    '大成标普500',
                    '国泰互联网股票',
                    '建信中证500',
                    '富国医疗保健行业混合'
                ];
                var test = {
                    buyin: [],
                    sellout: [],
                    accumulatedIncome: []
                }
                _.each(fundarry, function(v, k) {
                    test.buyin.push(self.buyin[v] ? self.buyin[v] : 0);
                    test.sellout.push(self.sellout[v] ? self.sellout[v] : 0);
                    test.accumulatedIncome.push(self.plus[v] - self.minus[v]);
                })
                console.log(test);

                Highcharts.chart('container', {
                    chart: {
                        zoomType: 'xy'
                    },
                    title: {
                        text: 'Average Monthly Weather Data for Tokyo'
                    },
                    subtitle: {
                        text: 'Source: WorldClimate.com'
                    },
                    xAxis: [{
                        // categories: ['fund1', 'fund2', 'fund3', 'fund4', 'fund5', 'fund6','fund7', 'fund8', 'fund9', 'fund10', 'fund11', 'fund12'],
                        categories: fundarry,
                        crosshair: true
                    }],
                    yAxis: [{ // Primary yAxis
                            min: 0,
                            max: 1500,
                            title: {
                                text: 'Sell-out'
                            },
                            stackLabels: {
                                // enabled: true,
                                style: {
                                    fontWeight: 'bold',
                                    color: (Highcharts.theme && Highcharts.theme.textColor) || 'gray'
                                }
                            }
                        }, {
                            // labels: {
                            //     format: '{value} 天',
                            //     style: {
                            //         color: Highcharts.getOptions().colors[1]
                            //     }
                            // },
                            title: {
                                text: 'Span',
                                style: {
                                    color: Highcharts.getOptions().colors[1]
                                }
                            },
                            opposite: true

                        }, {
                            max: 1500,
                            gridLineWidth: 0,
                            title: {
                                text: 'Accumulated Income',
                                style: {
                                    color: Highcharts.getOptions().colors[0]
                                }
                            },
                            stackLabels: {
                                enabled: true,
                                style: {
                                    fontWeight: 'bold',
                                    color: (Highcharts.theme && Highcharts.theme.textColor) || 'gray'
                                }
                            }
                            // labels: {
                            //     format: '￥ {value} ',
                            //     style: {
                            //         color: Highcharts.getOptions().colors[0]
                            //     }
                            // }

                        },
                        {
                            min: 0,
                            max: 1500,
                            title: {
                                text: 'Buy-in'
                            },
                            stackLabels: {
                                // enabled: true,
                                style: {
                                    fontWeight: 'bold',
                                    color: (Highcharts.theme && Highcharts.theme.textColor) || 'gray'
                                }
                            }
                        },
                    ],
                    tooltip: {
                        shared: true
                    },
                    legend: {
                        layout: 'vertical',
                        align: 'left',
                        x: 80,
                        verticalAlign: 'top',
                        y: 55,
                        floating: true,
                        backgroundColor: (Highcharts.theme && Highcharts.theme.legendBackgroundColor) || '#FFFFFF'
                    },
                    plotOptions: {
                        column: {
                            stacking: 'normal',
                            dataLabels: {
                                // enabled: true,
                                color: (Highcharts.theme && Highcharts.theme.dataLabelsColor) || 'white'
                            }
                        }
                    },
                    series: [

                        {
                            name: 'Accumulated Income',
                            type: 'column',
                            yAxis: 2,
                            // data: [49.9, 71.5, 106.4, 129.2, 144.0, 176.0, 135.6, 148.5, 216.4, 194.1, 95.6, 54.4],
                            data: test.accumulatedIncome,
                            tooltip: {
                                valueSuffix: ' 元'
                            }

                        },
                        {
                            name: 'Span',
                            type: 'spline',
                            yAxis: 1,
                            data: [30, 60, 90, 120, 14, 23, 69, 365, 48, 23, 69, 79],
                            tooltip: {
                                valueSuffix: ' 天'
                            }
                        },
                        {
                            name: 'Buy-in',
                            color: 'rgba(165,170,217,1)',
                            type: 'column',
                            yAxis: 3,
                            // data: [150, 73, 20,150, 73, 20,150, 73, 20,150, 73, 20],
                            data: test.buyin,
                            pointPadding: 0.3,
                            pointPlacement: -0.2
                        }, {
                            name: 'Sell-out',
                            color: 'rgba(126,86,134,.9)',
                            type: 'column',
                            // yAxis: 2,
                            // data: [140, 90, 40,140, 90, 40,140, 90, 40,140, 90, 40],
                            data: test.sellout,
                            pointPadding: 0.4,
                            pointPlacement: -0.2
                        },
                    ]
                });
            });
        },
        getBuyinSum: function() {
            var self = this;
            $.ajax({
                method: "POST",
                // url: "http://192.168.0.189:8080/risk-control/api/earning/getPnlAndGeneral",
                url: "http://127.0.0.1:8099/myfunds/public/index.php/index/index/buyinSum",
                data: {

                }
            }).always(function(res) {
                //假数据START
                // res = {"result":{"现金":35851.880111694,"工行9120":581658.8116833,"（京）富国医疗":5000,"余额宝（1h:2小时）":106405.04010582,"招商招利月度理财":1000,"平安养老富盈5号":2000,"（微）南方中正500ETF联接":1000,"（微）工银沪深300指数":1000,"京穗月月盈（2日）19号":30000,"京东小金库（即时：2小时）":95980.129859924,"历史持有项目":48699.420069277,"富国沪深300":1700,"大成标普500":1645,"农银医疗保健股票000913":1200,"组合宝113期-365天":2500,"简理财灵活取":1000,"真融宝定期360":2495,"挖财新人宝":10000,"真融宝定期180":10046.999531269,"交通卡":5350,"招行信用卡":74178.109985352,"盈钱宝1333":5025,"（挖财）盈信宝2354":10024,"盈钱宝1337":10000,"零活宝28日":9016,"零活宝-芝麻开花理财计划":11000,"陆金所可用余额":1631.200012207,"稳盈-e享计划":15377.540039062,"陆金宝":18504.64990598,"生息宝":4.6199998855591,"盈房宝373期":3010,"［自营］易方达沪深300量化增强110030":1200,"易方达上证50指数":200,"微信零钱":50,"京\/富国中证500指数增强":900,"外汇-英镑":215.13000488281,"可用余额":1000,"兴全":414.29998779297,"有利网余额":100,"医院自助卡":2100,"佣金宝可用资金":37143.929931641,"江苏银行":13893.18022728,"佣金宝兴全300":1363.0100002289,"工行12单存钱法9120":24000,"无忧宝":27900,"零活宝28日9-25":29017.999218751,"零活宝-2芝麻开花":1000,"南京药业":2577.0600585938,"京东白条":7612.000038147,"蚂蚁花呗":6045.2399845123,"定存宝3个月7%":6410.6000061035,"个人社保公积金":5131,"稳盈-安e+16092709338":9950,"微信零钱（？：？）":17688.689964294,"陆（零活宝T+0）":110847.36012268,"（京东）南方中证500":500,"还倪栋":6000,"京穗月月盈（14日）65号":8000,"宝宝生活费（栋）":28852.870128632,"亚马逊":6.3099999427795,"其他应收款":19806.119989395,"国泰估值优势混合LOF":1411,"易方达货币基金":6009.7202148438,"余额+易方达基金易理财":1000,"美年健康":6833,"深圳机场":899.5,"嘉实300":405.89999389648,"存金宝":550,"京东金条":1000.450012207,"张江高科":1858.5400390625,"仁和药业":2235.5,"中航高科":2489.5500488281,"（京东）天天盈":11786,"医院押金":6000,"宝钢股份":3406.5600585938,"富国中证红利指数增强":1404.4399414062,"京穗月月盈（22日）1号":10000,"南方上证380":400,"京穗季度盈":20000,"京穗月月盈（历史）":33000,"轻松投":13000,"积木盒子余额":4934.7200622559,"工行定存9120（5万）":86000,"［自营］南方中证500":200,"财富汇142":50000,"月月高415\/180206":5000,"随手宝":4201.6399993896,"月月高476\/180216":4000,"月月高480":70,"盈富宝819\/180316":10000,"交银施罗德消费新驱动":621.5,"景顺长城环保优势股票":671,"组合宝113期-10天":2500,"人品宝":6200,"长信量化先锋混合":728,"易方达消费行业股票":810,"工行8212":410.76998901367,"申万菱信沪深300增强":792,"富国医疗保健行业混合":450,"国泰金龙行业混合":576,"易方达安心回报债券B":765,"优加宝贝154904":1880,"❤️财通可持续组合":496,"富国沪深300指数增强":694,"金鹰稳健成长混合":540,"富国中证500增强":692,"国投瑞银新兴产业混合":540,"广发核心精选混合":387,"易方达上证50":653,"光大量化混合":540,"博时沪深300":788,"富国低碳环保":832,"定存宝12个月180410":9900,"盈拍宝177\/180412":10000,"月月高572":155,"盈拍宝180\/171009":10000,"摩拜押金":299,"ofo预充值":20,"定存宝180422":10000,"建信中证500":1080,"摩拜预存":20,"007课程-肩颈":1980,"纯爱气血循环":5160,"储值账户":9000,"保险理赔":91.740001678467,"携程饭卡":950,"真融宝定期90天171006":50000,"MBK":7800,"建信养老飞月宝170911":10000,"建行":1580,"还款金":100,"南方小康ETF":342,"国泰互联网股票":261,"招商中证白酒":162,"中石油加油卡":3000,"最福利积分":13.89999961853,"华夏理财30天":19917.48046875,"迟到罚款":20,"停车场预付":2310,"东亚信用卡":7709,"宝宝体检现金":915,"人品定期":1000,"账户2":0},"code":"200","resultMassage":"buyinSum查询成功","success":true};
                //假数据END
                console.log(res)
                self.buyin = res.result;
                self.getSelloutSum();
            });
        },
        getSelloutSum: function() {
            var self = this;
            $.ajax({
                method: "POST",
                // url: "http://192.168.0.189:8080/risk-control/api/earning/getPnlAndGeneral",
                url: "http://127.0.0.1:8099/myfunds/public/index.php/index/index/selloutSum",
                data: {

                }
            }).always(function(res) {
                //假数据START
                // res = {"result":{"景顺长城内需增长混合260104":693.63998031616,"好\/财通可持续混合000017":809.77998352051,"招商安本增利债券217008":402.91998672485,"好\/中海蓝筹混合398031":1411.5200195312,"积木盒子余额":4934.6200204492,"历史持有项目":23842.549865723,"工行9120":776043.80824834,"现金":75569.740001678,"京东小金库（即时：2小时）":95949.360267639,"余额宝（1h:2小时）":121029.46917152,"余额":1.7300000190735,"随手记新人宝277":5043.5401554108,"挖财新人宝":10028.619999886,"工行定存9120（5万）":93478.769287109,"人品宝":6253.7700195312,"组合宝113期-10天":2524.6599121094,"（微）工银沪深300指数":1045.4100341797,"华宝兴业新兴产业混合240017":607.47998046875,"盈钱宝1337":10460,"可用余额":1000,"稳盈-e享计划":15442.899749756,"陆金宝":18657.289990235,"微信零钱":141.09999847412,"佣金宝可用资金":35962.300426483,"有利网余额":129,"盈房宝373期":3016.75,"招商招利月度理财":1002.5,"盈钱宝1333":5052.6401367188,"零活宝-2芝麻开花":1000,"零活宝28日":9036,"生息宝":4.6199998855591,"积存贵金属":438.51000976562,"还倪栋":6000,"陆（零活宝T+0）":110974.36168671,"招行信用卡":41293.68999052,"京东白条":2981.1500244141,"蚂蚁花呗":2819.9300079346,"稳盈-安e+16092709338":4035.5700531006,"定存宝3个月7%":6515.6000061035,"（微）南方中正500ETF联接":1054.6800537109,"亚马逊":10,"微信零钱（？：？）":15611.860243797,"宝宝生活费（栋）":27411.820007324,"兴全":419.0299987793,"陆金所可用余额":1643.3499450684,"其他应收款":18454,"富国沪深300":1828.2600631714,"零活宝28日9-25":29526.340156555,"京东金条":1000,"佣金宝兴全300":1480,"余额+易方达基金易理财":1000.6000000238,"京穗月月盈（2日）19号":30773.130371094,"易方达货币基金":6023.5899658203,"［自营］易方达沪深300量化增强110030":1262.499961853,"大成标普500":1053.4399414062,"医院押金":5292.600189209,"宝钢股份":2140.8099975586,"（京东）天天盈":11811.08997345,"京穗月月盈（22日）1号":5,"飞牛网购物卡":245.69999694824,"（挖财）盈信宝2354":10331.58984375,"富国中证红利指数增强":1093.6699981689,"真融宝定期180":10488.990234375,"（京东）南方中证500":513.57998657227,"南方上证380":412.87999725342,"零活宝-芝麻开花理财计划":11247.450195312,"平安养老富盈5号":2037.9899902344,"个人社保公积金":5131,"轻松投":13000,"京穗月月盈（历史）":33191.020751953,"随手宝":4201.6399993896,"存金宝":517.95001220703,"国泰估值优势混合LOF":1369.549987793,"京\/富国中证500指数增强":925.20998382568,"工行8212":401.06998825073,"美年健康":7232.8601074219,"长信量化先锋混合":3.2300000190735,"京穗季度盈":20232.5390625,"❤️财通可持续组合":550.8900270462,"易方达上证50指数":208.55000305176,"月月高480":100.83999633789,"浙商银行":3400,"月月高572":201.63999938965,"无忧宝":19450,"深圳机场":943.54998779297,"保险理赔":91.740001678467,"京穗月月盈（14日）65号":8237.900390625,"交银施罗德消费新驱动":624.48999404907,"财富汇142":50963.69140625,"储值账户":7800,"建行":48958.059997559,"得仕卡":800,"嘉实300":415.29998779297,"易方达上证50":351.75,"易方达消费行业股票":353.13000488281,"富国沪深300指数增强":367.29000854492,"博时沪深300":344.20001220703,"真融宝定期360":2734.2399902344,"还款金":60,"携程饭卡":50,"富国中证500增强":496.42999267578,"申万菱信沪深300增强":370.85998535156,"景顺长城环保优势股票":383.42999267578,"富国低碳环保":805.70001220703,"建信中证500":747.64001464844,"易方达安心回报债券B":380.66000366211,"组合宝113期-365天":2752.0500488281,"建信养老飞月宝170911":4.1100001335144,"简理财灵活取":1087.3599853516,"东亚信用卡":12323.600008011,"国泰金龙行业混合":565.69999694824,"江苏银行":0.5,"中航高科":2535.9099121094,"［自营］南方中证500":208.80999755859,"国投瑞银新兴产业混合":540.46002197266,"网易白条":451.30999755859,"账户1":0},"code":"200","resultMassage":"selloutSum查询成功","success":true};
                //假数据END
                console.log(res)
                self.sellout = res.result;
                self.getMinusSum();


            });
        },
    }
})